package main

import (
	"fmt"
	"net/http"
	"runtime"
)

// Обработчик роута /hc - будет использоваться для тестирования и проверки состояния сервиса
func handleHealthcheckRoute(w http.ResponseWriter, r *http.Request) {
	w.Write([]byte("it works"))
}

// Обработчик корневого - будет выводить информацию о ОС и картинку из DOOM :)
func handleRootRoute(w http.ResponseWriter, r *http.Request) {
	fmt.Fprintf(w, "Operating system: %s\n OS architecture: %s\n\n", runtime.GOOS, runtime.GOARCH)

	w.Write([]byte(`
	+-----------------------------------------------------------------------------+
	| |       |\                                           -~ /     \  /          |
	|~~__     | \                                         | \/       /\          /|
	|    --   |  \                                        | / \    /    \     /   |
	|      |~_|   \                                   \___|/    \/         /      |
	|--__  |   -- |\________________________________/~~\~~|    /  \     /     \   |
	|   |~~--__  |~_|____|____|____|____|____|____|/ /  \/|\ /      \/          \/|
	|   |      |~--_|__|____|____|____|____|____|_/ /|    |/ \    /   \       /   |
	|___|______|__|_||____|____|____|____|____|__[]/_|----|    \/       \  /      |
	|  \mmmm :   | _|___|____|____|____|____|____|___|  /\|   /  \      /  \      |
	|      B :_--~~ |_|____|____|____|____|____|____|  |  |\/      \ /        \   |
	|  __--P :  |  /                                /  /  | \     /  \          /\|
	|~~  |   :  | /                                 ~~~   |  \  /      \      /   |
	|    |      |/                        .-.             |  /\          \  /     |
	|    |      /                        |   |            |/   \          /\      |
	|    |     /                        |     |            -_   \       /    \    |
	+-----------------------------------------------------------------------------+
	|          |  /|  |   |  2  3  4  | /~~~~~\ |       /|    |_| ....  ......... |
	|          |  ~|~ | % |           | | ~J~ | |       ~|~ % |_| ....  ......... |
	|   AMMO   |  HEALTH  |  5  6  7  |  \===/  |    ARMOR    |#| ....  ......... |
	+-----------------------------------------------------------------------------+`,
	))
}

func main() {
	// Маппим урлы на обработчики
	http.HandleFunc("/hc", handleHealthcheckRoute)
	http.HandleFunc("/", handleRootRoute)

	// Старт http сервера
	http.ListenAndServe(":3007", nil)
}
